----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 29, 128, 128]             290
       BatchNorm2d-2         [-1, 29, 128, 128]              58
              ReLU-3         [-1, 29, 128, 128]               0
            Conv2d-4         [-1, 29, 128, 128]           7,598
       BatchNorm2d-5         [-1, 29, 128, 128]              58
              ReLU-6         [-1, 29, 128, 128]               0
         ConvBlock-7         [-1, 29, 128, 128]               0
         MaxPool2d-8           [-1, 29, 64, 64]               0
      EncoderBlock-9  [[-1, 29, 128, 128], [-1, 29, 64, 64]]               0
           Conv2d-10          [-1, 128, 64, 64]          33,536
      BatchNorm2d-11          [-1, 128, 64, 64]             256
             ReLU-12          [-1, 128, 64, 64]               0
           Conv2d-13          [-1, 128, 64, 64]         147,584
      BatchNorm2d-14          [-1, 128, 64, 64]             256
             ReLU-15          [-1, 128, 64, 64]               0
        ConvBlock-16          [-1, 128, 64, 64]               0
        MaxPool2d-17          [-1, 128, 32, 32]               0
     EncoderBlock-18  [[-1, 128, 64, 64], [-1, 128, 32, 32]]               0
           Conv2d-19          [-1, 256, 32, 32]         295,168
      BatchNorm2d-20          [-1, 256, 32, 32]             512
             ReLU-21          [-1, 256, 32, 32]               0
           Conv2d-22          [-1, 256, 32, 32]         590,080
      BatchNorm2d-23          [-1, 256, 32, 32]             512
             ReLU-24          [-1, 256, 32, 32]               0
        ConvBlock-25          [-1, 256, 32, 32]               0
        MaxPool2d-26          [-1, 256, 16, 16]               0
     EncoderBlock-27  [[-1, 256, 32, 32], [-1, 256, 16, 16]]               0
           Conv2d-28          [-1, 512, 16, 16]       1,180,160
      BatchNorm2d-29          [-1, 512, 16, 16]           1,024
             ReLU-30          [-1, 512, 16, 16]               0
           Conv2d-31          [-1, 512, 16, 16]       2,359,808
      BatchNorm2d-32          [-1, 512, 16, 16]           1,024
             ReLU-33          [-1, 512, 16, 16]               0
        ConvBlock-34          [-1, 512, 16, 16]               0
        MaxPool2d-35            [-1, 512, 8, 8]               0
     EncoderBlock-36  [[-1, 512, 16, 16], [-1, 512, 8, 8]]               0
           Conv2d-37           [-1, 1024, 8, 8]       4,719,616
      BatchNorm2d-38           [-1, 1024, 8, 8]           2,048
             ReLU-39           [-1, 1024, 8, 8]               0
           Conv2d-40           [-1, 1024, 8, 8]       9,438,208
      BatchNorm2d-41           [-1, 1024, 8, 8]           2,048
             ReLU-42           [-1, 1024, 8, 8]               0
        ConvBlock-43           [-1, 1024, 8, 8]               0
  ConvTranspose2d-44          [-1, 512, 16, 16]       2,097,664
           Conv2d-45          [-1, 512, 16, 16]       4,719,104
      BatchNorm2d-46          [-1, 512, 16, 16]           1,024
             ReLU-47          [-1, 512, 16, 16]               0
           Conv2d-48          [-1, 512, 16, 16]       2,359,808
      BatchNorm2d-49          [-1, 512, 16, 16]           1,024
             ReLU-50          [-1, 512, 16, 16]               0
        ConvBlock-51          [-1, 512, 16, 16]               0
     DecoderBlock-52          [-1, 512, 16, 16]               0
  ConvTranspose2d-53          [-1, 256, 32, 32]         524,544
           Conv2d-54          [-1, 256, 32, 32]       1,179,904
      BatchNorm2d-55          [-1, 256, 32, 32]             512
             ReLU-56          [-1, 256, 32, 32]               0
           Conv2d-57          [-1, 256, 32, 32]         590,080
      BatchNorm2d-58          [-1, 256, 32, 32]             512
             ReLU-59          [-1, 256, 32, 32]               0
        ConvBlock-60          [-1, 256, 32, 32]               0
     DecoderBlock-61          [-1, 256, 32, 32]               0
  ConvTranspose2d-62          [-1, 128, 64, 64]         131,200
           Conv2d-63          [-1, 128, 64, 64]         295,040
      BatchNorm2d-64          [-1, 128, 64, 64]             256
             ReLU-65          [-1, 128, 64, 64]               0
           Conv2d-66          [-1, 128, 64, 64]         147,584
      BatchNorm2d-67          [-1, 128, 64, 64]             256
             ReLU-68          [-1, 128, 64, 64]               0
        ConvBlock-69          [-1, 128, 64, 64]               0
     DecoderBlock-70          [-1, 128, 64, 64]               0
  ConvTranspose2d-71         [-1, 29, 128, 128]          14,877
           Conv2d-72         [-1, 29, 128, 128]          15,167
      BatchNorm2d-73         [-1, 29, 128, 128]              58
             ReLU-74         [-1, 29, 128, 128]               0
           Conv2d-75         [-1, 29, 128, 128]           7,598
      BatchNorm2d-76         [-1, 29, 128, 128]              58
             ReLU-77         [-1, 29, 128, 128]               0
        ConvBlock-78         [-1, 29, 128, 128]               0
     DecoderBlock-79         [-1, 29, 128, 128]               0
================================================================
Total params: 30,866,114
Trainable params: 30,866,114
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.06
Forward/backward pass size (MB): 1118543.84
Params size (MB): 117.74
Estimated Total Size (MB): 1118661.65
----------------------------------------------------------------
